#+PROPERTY: header-args :tangle ./test_dataseries.py :mkdirp yes
** Base line model

#+begin_src python :session py1
  #######################
  base_model = model_factory('keras', 'Model', None, config.lstm)

  #base_model.set_params(**winner)
  base_model.fit(Xtrain, ytrain, epochs=100, verbose=2)

  # summary
  #base_model._model.summary()

#+end_src

#+RESULTS:
: Model(batch_size=1,
:       layers=(('LSTM_1', (('units', 4), ('name', 'LSTM1'))),
:               ('Dense_1', (('units', 1), ('name', 'Output')))),
:       loss_name='mean_squared_error',
:       metrics=['accuracy', 'binary_accuracy', 'mse'], seqlen=1)

